renedis/esp32-ups-nut-server/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=512
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_IP101=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SOCKET_SELECT_FUNC=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
